
def area(a, b): 
    '''
    Считает площадь прямоугольника

        Параметры:
            a (float): ширина прямоугольника
            b (float): высота прямоугольника

        Возвращаемое значение: 
            (float) Площадь прямоугольника размером a на b
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Считает периметр прямоугольника

        Параметры:
            a (float): ширина прямоугольника
            b (float): высота прямоугольника

        Возвращаемое значение: 
            (float) Периметр прямоугольника размером a на b
    '''
    return 2 * (a + b)
