def area(a, h): 
    '''
    Считает площадь треугольника

        Параметры:
            a (float): длина основания
            h (float): длина высоты, проведённой к основанию

        Возвращаемое значение: 
            (float) Площадь треугольника
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Считает периметр треугольника

        Параметры:
            a (float): длина первой стороны
            b (float): длина второй стороны
            с (float): длина третей стороны

        Возвращаемое значение: 
            (float) Периметр треугольника треугольника
    '''
    return a + b + c 
